In [2]:
import numpy as np 
import pandas as pd

In [4]:
data = {"Character" : ["South Park","South Park","Simpson","Simpson"],
       "Character Name": ["Cartman","Kenny","Homer","Bart"],
       "Character Age" : [9,10,12,15]
       }

In [8]:
data

{'Character': ['South Park', 'South Park', 'Simpson', 'Simpson'],
 'Character Name': ['Cartman', 'Kenny', 'Homer', 'Bart'],
 'Character Age': [9, 10, 12, 15]}

In [10]:
df = pd.DataFrame(data)
df

    Character Character Name  Character Age
0  South Park        Cartman              9
1  South Park          Kenny             10
2     Simpson          Homer             12
3     Simpson           Bart             15

In [14]:
df.pivot_table(values = "Character Age", index=["Character","Character Name"])

                           Character Age
Character  Character Name
Simpson    Bart                     15.0
           Homer                    12.0
South Park Cartman                   9.0
           Kenny                    10.0